In [8]:
#FINDING THE DUPICATE VALUES USING PANDAS

In [ ]:
#IMPORTING PANDAS
import pandas as pd

In [2]:
data=pd.read_csv("C:\\Users\\Beast\\Downloads\\archive\\Groceries_dataset.csv")#READING THE CSV FILE

In [3]:
data.head()

   Member_number        Date   itemDescription
0           1808  21-07-2015    tropical fruit
1           2552  05-01-2015        whole milk
2           2300  19-09-2015         pip fruit
3           1187  12-12-2015  other vegetables
4           3037  01-02-2015        whole milk

In [5]:
data.shape#SHAPE OF THE TABLE

(38765, 3)

In [6]:
data.itemDescription.duplicated()#USING DUPLICATED METHOD TO SEE IF WE HAVE ANY DUPLICATED DATA IN INTEMDESCRIPTION COLUMN

0        False
1        False
2        False
3        False
4         True
         ...
38760     True
38761     True
38762     True
38763     True
38764     True
Name: itemDescription, Length: 38765, dtype: bool

In [10]:
data.itemDescription.duplicated().sum()#SUM() COUNTS THE TOTAL NUMBER OF DUPLCATE VALUES IN ITEMDESCRIPTION COLUMN

38598

In [11]:
data.duplicated()#TO SEE ALL THE DUPLICATE ROWS IN ENTIRE DATA

0        False
1        False
2        False
3        False
4        False
         ...
38760    False
38761    False
38762    False
38763    False
38764    False
Length: 38765, dtype: bool

In [12]:
data.duplicated().sum()#TOTAL NUMBER OF DUPLICATE ROWS IN DATA

759

In [13]:
data.loc[data.duplicated(), :]#SEEING ALL THE DUPLICATE ROWS

       Member_number        Date   itemDescription
5015            2051  11-09-2015       frankfurter
5022            3055  18-08-2015  other vegetables
5044            1994  11-03-2015        whole milk
5055            1682  25-06-2015         pip fruit
5059            4324  05-01-2015           sausage
...              ...         ...               ...
38614           2027  26-02-2014     domestic eggs
38684           2936  07-03-2014        newspapers
38685           2311  13-03-2014        pot plants
38722           3834  18-05-2014       salty snack
38723           1146  23-05-2014            yogurt

[759 rows x 3 columns]

In [ ]:
#REMOVING THE DUPICATE VALUES

In [14]:
data.drop_duplicates(keep="first").shape#DROP_DUPLICATES REMOVES THE DUPLICATE ROWS ,KEEP="FIRST" WILL KEEP THE FIRST VALUES AND REMOVE THE SECOND DUPLICATE VALUE

(38006, 3)

In [15]:
data.drop_duplicates(keep="last").shape#KEEP="LAST" WILL KEEP THE LAST VALUES AND REMOVE THE FIRST DUPLICATE VALUES

(38006, 3)

In [17]:
data.drop_duplicates(keep=False).shape#KEEP="FALSE" WILL REMOVE ALL THE DUPLICATE VALUES

(37274, 3)

WHAT IS DIMENSION REDUCTION?

Dimensionality reduction is the process of reducing the dimension of our feature set. Your feature set could be a dataset with a hundred columns or it could be an array of points that make up a large sphere in the three-dimensional space. Dimensionality reduction is bringing the number of columns down to say, twenty or converting the sphere to a circle in the two-dimensional space.